ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV149/ESP32_WordClockV149.ino
 const char *menusmall[] = {
 "F Own colour (Hex FWWRRGGBB)",
 "I Menu, II long menu",
 "N Display off between Nhhhh (N2208)",
 "O Display On/Off",
 "Q Display colour choice (Q0)",
 "R Reset settings, @ Restart" };
//  -------------------------------------   End Definitions  ---------------------------------------

//--------------------------------------------                                                //
// ARDUINO Setup
//--------------------------------------------
void setup() 
{
 Serial.begin(115200);                                                                        // Setup the serial port to 115200 baud
 Wire.begin();
 int32_t Tick = millis(); 
 SetStatusLED(10,0,0);                                                                        // Set the status LED to red
 while (!Serial && ( (millis()-Tick) < 1502)) { delay(250); }                                 // Wait max 1.5 sec to establish serial connection
 InitStorage();                                                                               // Load settings from storage and check validity   
 StartLeds();
 printHeaps();                                                                                 // LED RainbowCycle  
 while (!Serial && ( (millis()-Tick) < 3000) ) { LEDstartup(green); delay(499); }             // Wait max 3 sec to establish serial connection
 LEDstartup(capri); Tekstprintln("Serial started\nStored settings loaded\nLED strip started");// InitStorage and StartLEDs must be called first
    #ifdef ARDUINO_BOARD
 Tekstprint("Compiled on: "); Tekstprintln(ARDUINO_BOARD);
    #endif
 Mem.MCUrestarted++;                                                                          // MCU Restart counter     
 if(Mem.MCUrestarted>5) { Reset();  ResetCredentials(); }                                     // If the MCU restarts during Setup() so often Reset all 
 StoreStructInFlashMemory();                                                                  // 
 Tekstprintlnf( "Using %s LED library", UsedEDSOFTLED?"EDSOFTLED":"NEOPIXEL");                                                           // 
 if(Mem.UseRotary==1) {LEDstartup(pink);  InitRotaryMod(); Tekstprintln("Rotary available"); }// Start the Rotary encoder
 if(Mem.UseRotary==2) {LEDstartup(grass); InitKeypad3x1(); Tekstprintln("Keypad available"); }// Start the Keypad 3x1 
 if(Mem.UseRotary >2) {LEDstartup(white);Start_IRreceiver();Tekstprintln("IRremote available");}// Start IR remote Mem.UseRotary = 3 or 4                                                                                     
 if(Mem.BLEOn)        {LEDstartup(blue);StartBLEService(); Tekstprintln("BLE started"); }     // Start BLE service 
 if(Mem.WIFIOn)       {LEDstartup(purple); ConnectWIFI();  Tekstprintln("WIFI started");}     // Start WIFI and optional NTP if Mem.WIFIOn = 1 
 InitTimeSystem();     LEDstartup(yellow); Tekstprintln("Time system started");               // Initialize RTC + DS3231 sync
 Previous_LDR_read = ReadLDR();                                                               // Set the initial LDR reading 
 GetTijd(true);                                                                               // Get the time and do not print it
 LEDstartup(green);                                                                           // Set the status LED to green
 SWversion();                                                                                 // Print the menu + version 
 Mem.MCUrestarted = 0;                                                                        // Startup went well; Set MCUrestart counter to 0    
 StoreStructInFlashMemory();                                                                  // 
 delay(250);
 LEDstartup(CLEARLEDSTARTUP);                                                                 // Erase the startup LEDs
 Tekstprintln("Setup finished");
 msTick = millis();                                                                           // Start the seconds loop counter
}

//--------------------------------------------                                                //
// ARDUINO Loop
//--------------------------------------------
void loop() 
{
 Loopcounter++;
 if (Demo)            Demomode();                                                             // 
 else if(FireDisplay) FireMode();                                                             //
 else                 EverySecondCheck();                                                     // Let the second led tick and run the clock program
 CheckDevices();
}

//--------------------------------------------                                                //
// COMMON Check connected input devices
//--------------------------------------------
void CheckDevices(void)
{
 CheckBLE();                                                                                  // Something with BLE to do?
 SerialCheck();                                                                               // Check serial port every second 
 if (OptionYRainbow ) { ReworkInputString("Y"); OptionYRainbow=false;}                        // The LED library’s timing can get interrupted by background WiFi interrupts, causing flicker in the strip.
 if (Mem.UseRotary==1) RotaryEncoderCheck();
 if (Mem.UseRotary==2) Keypad3x1Check();                                                      // --> Every100mSecCheck
                                  #ifdef ONEWIREKEYPAD3x4   
 OnewireKeypad3x4Check(); 
                                  #endif  //ONEWIREKEYPAD3x4
                                  #ifdef ONEWIREKEYPAD3x1   
 OnewireKeypad3x1Check(); 
                                  #endif  //ONEWIREKEYPAD3x1
 if (ntpJustSynced) CheckandPrintNTPsynced();                                 
}
//--------------------------------------------                                                //
// COMMON Update routine 
// Performs tasks every second
//--------------------------------------------
void EverySecondCheck(void)
{
 static bool Toggle = 0;
 uint32_t msLeap = millis() - msTick;                                                       // 
 if (msLeap % 100) Every100mSecCheck();
 if (msLeap > 999)                                                                            // Every second enter the loop
  {
   msTick = millis();
   GetTijd(false);                                                                            // Get the time for the seconds 
   Toggle = !Toggle;                                                                          // Used to turn On or Off Leds
   UpdateStatusLEDs(Toggle);
   SetSecondColour();                                                                         // Set the colour per second of 'IS' and 'WAS' 
   DimLeds(TestLDR);                                                                          // Every second an intensity check and update from LDR reading 
   if (shouldReboot) { delay(3000);   ESP.restart(); }                                        // After finish OTA update restarts after 3 seconds. 1 second is too fast
   if (timeinfo.tm_min != lastminute) EveryMinuteUpdate();                                    // Enter the every minute routine after one minute; 
   Loopcounter=0;
 }  
}
//--------------------------------------------                                                //
// COMMON Update routine 
  // Performs tasks every 0.1 second
//--------------------------------------------
void Every100mSecCheck(void)
{
 if (Mem.UseRotary==3 || Mem.UseRotary==4) IrReceiverDecode();
}
//--------------------------------------------                                                //
// COMMON Update routine done every minute
//-------------------------------------------- 
void EveryMinuteUpdate(void)
{   
 lastminute = timeinfo.tm_min;  
 if (Mem.RandomDisplay == 1) { ChangeRandomDisplay(); SetSecondColour();} 
 if (IR_PowerOnstate && ((millis() - IR_StartTime) > 290000) ) ToggleIRpower();               // Turn off Power after 300 seconds 
 GetTijd(false);
 Displaytime();                                                                               // If Mem.TimeMinute == 0 the time (controlled in ColorLeds()
 DimLeds(!Mem.TimeMinute);                                                                    // and DimLEDs are used to print the time every minute
 if(timeinfo.tm_hour != lasthour) EveryHourUpdate(); 
}
//--------------------------------------------                                                //
// COMMON Update routine done every hour
//--------------------------------------------
void EveryHourUpdate(void)
{
 lasthour = timeinfo.tm_hour;
 if (!Mem.StatusLEDOn) SetStatusLED(0,0,0);                                                   // If for some reason the LEDs are ON and after a MCU restart turn them off.  
 if( (timeinfo.tm_hour == Mem.TurnOffLEDsAtHH) && (Mem.TurnOffLEDsAtHH != Mem.TurnOnLEDsAtHH))
       { LEDsAreOff = true;  ClearScreen(); }                                                 // Is it time to turn off the LEDs?
 if(timeinfo.tm_hour == Mem.TurnOnLEDsAtHH)
   { LEDsAreOff = false;   lastminute = 99;     Displaytime(); }                              // Force a minute update
 CheckRestoreWIFIconnectivity();                                                              // Check if WIFI is still connected and if not restore it
 Mem.NVRAMmem[lasthour] =(byte)((SumLDRreadshour / NoofLDRreadshour?NoofLDRreadshour:1));     // Update the average LDR readings per hour. Avoids dividing by zero
 SumLDRreadshour  = 0;
 NoofLDRreadshour = 0;                                                    // Check if WIFI is still connected and if not restore it
 if (Mem.RandomDisplay == 2) { ChangeRandomDisplay(); SetSecondColour();}                     // If RandomDisplay is ON change the display choice
 if (timeinfo.tm_mday != lastday) EveryDayUpdate();  
}
//--------------------------------------------                                                //
// COMMON Update routine done every day
//--------------------------------------------
void EveryDayUpdate(void)
{
 lastday           = timeinfo.tm_mday; 
 Previous_LDR_read = ReadLDR();                                                               // to have a start value and reset the Min Max measurements 
 MinPhotocell      = Previous_LDR_read;                                                       // Stores minimum reading of photocell;
 MaxPhotocell      = Previous_LDR_read;                                                       // Stores maximum reading of photocell;                                 
 StoreStructInFlashMemory();                                                                  // Update Mem struct once a day to store Mem.NVRAM measurements
}

//--------------------------------------------                                                //
// COMMON Update routine for the status LEDs
//-------------------------------------------- 
void UpdateStatusLEDs(bool Toggle)
{
 if(Mem.StatusLEDOn)   
   {
    SetStatusLED((Toggle && WiFi.localIP()[0]==0) * 20, 
                 (Toggle && WiFi.localIP()[0]!=0) * 20 , 
                 (Toggle && deviceConnected) * 20);
    SetPCBLED09(   Toggle * 10);                                                              // Left LED
    SetPCBLED10((!Toggle) * 10);                                                              // Right LED
    SetNanoLED13((!Toggle) * (!Mem.UseDS3231 * 50));                                          // LED on ESP32 board. IF DS3231 in use then it is off
   }
   else
   {
    SetStatusLED(0, 0, 0); 
    SetPCBLED09(0);                                                                           //
    SetPCBLED10(0);                                                                           //
    SetNanoLED13(0);      
   }
}
//--------------------------------------------                                                //
// COMMON Control the RGB LEDs on the Nano ESP32
// Analog range 0 - 512. 0 is LED Off, 512 is max intensity
// 512 is LED off. Therefore the value is subtracted from 512
// in core 3 the value to write is 13-bit 8191 to turn off the led completely
//  rgbLedWrite(512-Red,512-Green,512-Blue);
//--------------------------------------------
void SetStatusLED(int Red, int Green, int Blue)                                               // If LED should be off, use digitalWrite instead of analogWrite
{
 analogWrite(LED_RED,   Red   == 0 ? 8191 : (512 - Red));
 analogWrite(LED_GREEN, Green == 0 ? 8191 : (512 - Green));
 analogWrite(LED_BLUE,  Blue  == 0 ? 8191 : (512 - Blue));
}
//--------------------------------------------                                                //
// COMMON Control orange LED D13 on the Arduino 
//--------------------------------------------
void SetNanoLED13(int intensity) {analogWrite(secondsPin, intensity);}
//--------------------------------------------                                                //
// COMMON Control the RGB LED on the PCB
//--------------------------------------------
void SetPCBLED09(int intensity) {analogWrite(PCB_LED_D09, intensity);}
void SetPCBLED10(int intensity) {analogWrite(PCB_LED_D10, intensity);}

//--------------------------------------------                                                //
// COMMON check for serial input
//--------------------------------------------
void SerialCheck(void)
{
 String SerialString; 
 while (Serial.available())
    { 
     char c = Serial.read();                                                                  // Serial.write(c);
     if (c>31 && c<128) SerialString += c;                                                    // Allow input from Space - Del
     else c = 0;                                                                              // Delete a CR
    }
 if (SerialString.length()>0) 
    {
     ReworkInputString(SerialString);                                                         // Rework ReworkInputString();
     SerialString = "";
    }
}

//--------------------------------------------                                                //
// COMMON Reset to default settings. BLE On, WIFI NTP Off
//--------------------------------------------
void Reset(void)
{
 Mem.Checksum         = 25065;                                                                //
 Mem.DisplayChoice    = DEFAULTCOLOUR;                                                        // Default colour scheme 
 Mem.OwnColour        = green;                                                                // Own designed colour.
 Mem.DimmedLetter     = dgray;
 Mem.BackGround       = black; 
 Mem.LanguageChoice   = 0;                                                                    // 0 = NL, 1 = UK, 2 = DE, 3 = FR, 4 = Wheel
 Mem.LightReducer     = SLOPEBRIGHTNESS;                                                      // Factor to dim ledintensity with. Between 0.1 and 1 in steps of 0.05
 Mem.UpperBrightness  = MAXBRIGHTNESS;                                                        // Upper limit of Brightness in bits ( 1 - 1023)
 Mem.LowerBrightness  = LOWBRIGHTNESS;                                                        // Lower limit of Brightness in bits ( 0 - 255)
 Mem.TurnOffLEDsAtHH  = 0;                                                                    // Display Off at nn hour
 Mem.TurnOnLEDsAtHH   = 0;                                                                    // Display On at nn hour Not Used
 Mem.HetIsWasOff      = 0;                                                                    // Turn On or Off HET IS WAS   
 Mem.EdSoftLEDSOn     = 0;                                                                    // Turn On or Off EDSOFT LEDs
 Mem.RandomDisplay    = 0;                                                                    // Choose every day another display
 Mem.WIFInoConnection = 0;                                                                    // Restarts after 30 minutes no connection 
 Mem.BLEOn            = 1;                                                                    // default BLE On
 Mem.UseBLELongString = 0;                                                                    // Default off. works only with iPhone/iPad with BLEserial app
 Mem.NTPOn            = 0;                                                                    // NTP default off
 Mem.WIFIOn           = 0;                                                                    // WIFI default off
 Mem.MCUrestarted     = 0;                                                                    // MCU Restarts during Setup() counter caused by unknown errors during startup
 Mem.LoopRebooted     = 0;                                                                    // Reboots cause by less than 10 loops /second. Program hangs or severly delayed
 Mem.WIFIcredentials  = NOT_SET;                                                              // Status of the WIFI connection
 //Mem.UseRotary      = 0;    // Do not erase this setting with a reset                       // Use the rotary coding
 Mem.DCF77On          = 0;                                                                    // Default off
 Mem.UseDS3231        = 0;                                                                    // Default off
 //Mem.LEDstrip       = 0;    // Do not erase this setting with a reset                       // 0 = SK6812, 1=WS2812
 Previous_LDR_read    = ReadLDR();                                                            // Read LDR to have a start value. max = 4096/8 = 255
 MinPhotocell         = Previous_LDR_read;                                                    // Stores minimum reading of photocell;
 MaxPhotocell         = Previous_LDR_read;                                                    // Stores maximum reading of photocell;                                            
 TestLDR              = 0;                                                                    // If true LDR display is printed every second
 for (int i = 0; i < NOOFBUTTONS; i++)  IRMem.buttons[i].learned = 0;
 Tekstprintln("**** Reset of preferences ****"); 
 //ResetCredentials();
 StoreStructInFlashMemory();                                                                  // Update Mem struct       
 GetTijd(false);                                                                              // Get the time and store it in the proper variables
 SWversion();                                                                                 // Display the version number of the software
 Displaytime();
}
//--------------------------------------------                                                //
// COMMON Reset to empty credential settings WIFI, NTP, BLE ON
//--------------------------------------------
void ResetCredentials(void)
{
 strcpy(Mem.SSID,"");                                                                         // Default SSID
 strcpy(Mem.Password,"");                                                                     // Default password
 strcpy(Mem.BLEbroadcastName,"WordClock");
 strcpy(Mem.Timezone,"CET-1CEST,M3.5.0,M10.5.0/3");                                           // Central Europe, Amsterdam, Berlin etc.
 Mem.WIFIcredentials  = 0;                                                                    // Status of the WIFI connection  
 Mem.WIFIOn           = 1;                                                                    // WIFI on
 Mem.NTPOn            = 1;
 Mem.BLEOn            = 1;                                                                    // default BLE On
 StoreStructInFlashMemory();                                                                  // Update Mem struct   
}
//--------------------------------------------                                                //
// COMMON common print routines
// %s - String
// %d - Integer (decimal)
// %04X - Hex with 4 digits, uppercase, leading zeros
// %08X - Hex with 8 digits, uppercase, leading zeros
// PRIX32 - 32-bit hex for uint32_t values
//--------------------------------------------
void Tekstprint(char const *tekst)    { if(Serial) Serial.print(tekst);  SendMessageBLE(tekst); AddLog(tekst);} //sptext[0]=0; } 
void Tekstprintln(char const *tekst)  { snprintf(sptext, sizeof(sptext),"%s\n",tekst); Tekstprint(sptext); }
void TekstSprint(char const *tekst)   { printf(tekst); } //sptext[0]=0;}                      // printing for Debugging purposes in serial monitor 
void TekstSprintln(char const *tekst) { snprintf(sptext, sizeof(sptext),"%s\n",tekst); TekstSprint(sptext); }

//--------------------------------------------                                                //
// Usage:
// Tekstprintlnf("Log buffer allocated: %u bytes", (unsigned) LogBufferSize);
// Tekstprintf("Log buffer allocated: %u bytes\n", (unsigned) LogBufferSize);
//--------------------------------------------
void Tekstprintf(const char* fmt, ...) 
 {
  va_list args;
  va_start(args, fmt);
  vsnprintf(sptext, sizeof(sptext), fmt, args);
  va_end(args);
  Tekstprint(sptext);
 }

void Tekstprintlnf(const char* fmt, ...) 
 {
  va_list args;
  va_start(args, fmt);
  vsnprintf(sptext, sizeof(sptext), fmt, args);
  va_end(args);
  Tekstprintln(sptext);
}

//--------------------------------------------                                                //
// COMMON Print web menu page and BLE menu
// 0 = text to print, 1 = header of web page with menu, 2 = footer of web page
// html_info must be empty before starting: --> html_info[0] = 0; 
//--------------------------------------------
void WTekstappend(char const *tekst, char const *prefixtekst, char const *suffixtekst, bool newline) 
{
 if (newline) { snprintf(sptext, sizeof(sptext), "%s\n", tekst); } 
 else {         snprintf(sptext, sizeof(sptext), "%s", tekst);   }
 if(Mem.MCUrestarted == 0) Tekstprint(sptext);                                                // During a normal startup the menu is printed during startup proces.
 size_t needed = strlen(prefixtekst) + strlen(tekst) + strlen(suffixtekst) + strlen("<br>");  // Estimate how much space will be added
 if (strlen(html_info) + needed > MAXSIZE_HTML_INFO - 1) 
     { strcat(html_info, "<br> *** Increase MAXSIZE_HTML_INFO ***<br>");   return;  }
 strcat(html_info, prefixtekst);                                             
 strcat(html_info, tekst);
 strcat(html_info, suffixtekst);
 if (newline) { strcat(html_info, "<br>"); }   // Append to html_info
}

void WTekstprintln(char const *tekst) { WTekstappend(tekst, "", "", true);}
void WTekstprintln(char const *tekst, char const *prefixtekst, char const *suffixtekst) 
                                      { WTekstappend(tekst, prefixtekst, suffixtekst, true); }

